fonecmid-diplom/src/Documents/ВКМ_НачислениеЗаработнойПлаты/ВКМ_НачислениеЗаработнойПлаты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_НачислениеЗаработнойПлаты</name>
  <registerRecords>CalculationRegister.BKM_Удержания</registerRecords>
  <registerRecords>CalculationRegister.ВКМ_ОсновныеНачисления</registerRecords>
  <registerRecords>AccumulationRegister.ВКМ_ВзаиморасчетыССотрудниками</registerRecords>
  <registerRecords>CalculationRegister.ВКМ_ДополнительныеНачисления</registerRecords>
  <attributes>
    <name>Ответсвенный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОсновныеНачислния</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ВКМ_Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидРасчета</name>
      <type>
        <types>ChartOfCalculationTypesRef.ВКМ_ОсновныеНачисления</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>График</name>
      <type>
        <types>CatalogRef.ВКМ_График</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеНачисления</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ВКМ_Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВсегоЧасов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/InformationRegisters/ВКМ_УсловияОплатыСотрудников/ВКМ_УсловияОплатыСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВКМ_УсловияОплатыСотрудников</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>Оклад</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПроцентОтРабот</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>График</name>
    <type>
      <types>CatalogRef.ВКМ_График</types>
    </type>
  </resources>
  <resources>
    <name>Категория</name>
    <type>
      <types>EnumRef.ВКМ_КатегорияСотрудника</types>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ВКМ_Сотрудники</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

fonecmid-diplom/src/AccumulationRegisters/ВКМ_ВыполненныеСотрудникомРаботы/ВКМ_ВыполненныеСотрудникомРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ВыполненныеСотрудникомРаботы</name>
  <resources>
    <name>ВсегоЧасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВсегоКОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ВКМ_Сотрудники</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

fonecmid-diplom/src/Documents/ВКМ_НачислениеЗаработнойПлаты/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если  Не ДатыЗаполненыВерно() Тогда
		 Отказ = Истина;
	 КонецЕсли;
	 
КонецПроцедуры


#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Асинх Процедура Заполнить(Команда) 
	
	Если Объект.ОсновныеНачислния.Количество()  <> 0 ИЛИ Объект.ДополнительныеНачисления.Количество()<> 0 Тогда
			
		Результат = Ждать ВопросАсинх("Табличные части начислений будут очищены. Продолжить?", 
		РежимДиалогаВопрос.ДаНет,,,"Вопрос.");	
		
		Если Результат = Неопределено Или Результат = КодВозвратаДиалога.Нет Тогда				
			Возврат;			
		КонецЕсли; 
		
	КонецЕсли;
			
	ЗаполнитьНаСервере(); 
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьНаСервере()
		
	Объект.ОсновныеНачислния.Очистить();
	Объект.ДополнительныеНачисления.Очистить();
	Запрос = Новый Запрос;
	Запрос. Текст = 
	"ВЫБРАТЬ
	|	BKM_УсловияОплатыСотрудниковСрезПоследних.Сотрудник КАК Сотрудник
	|ПОМЕСТИТЬ ВТ_Сотрудники
	|ИЗ
	|	РегистрСведений.ВКМ_УсловияОплатыСотрудников.СрезПоследних(&НачалоПериода, ) КАК BKM_УсловияОплатыСотрудниковСрезПоследних
	|ГДЕ
	|	НЕ BKM_УсловияОплатыСотрудниковСрезПоследних.Сотрудник.ПометкаУдаления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	BKM_ВыполненныеСотрудникомРаботы.Сотрудник КАК Сотрудник,
	|	СУММА(BKM_ВыполненныеСотрудникомРаботы.ВсегоЧасов) КАК ВсегоЧасов,
	|	СУММА(BKM_ВыполненныеСотрудникомРаботы.ВсегоКОплате) КАК Сумма
	|ПОМЕСТИТЬ ВТ_Корректировка
	|ИЗ
	|	РегистрНакопления.ВКМ_ВыполненныеСотрудникомРаботы КАК BKM_ВыполненныеСотрудникомРаботы
	|ГДЕ
	|	BKM_ВыполненныеСотрудникомРаботы.Регистратор = &Ссылка
	|	И BKM_ВыполненныеСотрудникомРаботы.Сотрудник В
	|			(ВЫБРАТЬ
	|				ВТ_Сотрудники.Сотрудник КАК Сотрудник
	|			ИЗ
	|				ВТ_Сотрудники КАК ВТ_Сотрудники)
	|
	|СГРУППИРОВАТЬ ПО
	|	BKM_ВыполненныеСотрудникомРаботы.Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(BKM_УсловияОплатыСотрудниковСрезПоследних.График, ЗНАЧЕНИЕ(Справочник.ВКМ_График.ПустаяСсылка)) КАК График,
	|	ЕСТЬNULL(BKM_ВыполненныеСотрудникомРаботыОстаткиИОбороты.ВсегоЧасовОборот, 0) + ЕСТЬNULL(ВТ_Корректировка.ВсегоЧасов, 0) + ЕСТЬNULL(BKM_ВыполненныеСотрудникомРаботыОстаткиИОбороты.ВсегоЧасовНачальныйОстаток, 0) КАК ВсегоЧасов,
	|	&НачалоПериода КАК ДатаНачала,
	|	&КонецПериода КАК ДатаОкончания,
	|	ЗНАЧЕНИЕ(ПланВидовРасчета.ВКМ_ОсновныеНачисления.Оклад) КАК ВидРасчета,
	|	ВТ_Сотрудники.Сотрудник КАК Сотрудник,
	|	ЕСТЬNULL(BKM_ВыполненныеСотрудникомРаботыОстаткиИОбороты.ВсегоКОплатеОборот, 0) + ЕСТЬNULL(ВТ_Корректировка.Сумма, 0) + ЕСТЬNULL(BKM_ВыполненныеСотрудникомРаботыОстаткиИОбороты.ВсегоКОплатеНачальныйОстаток, 0) КАК Сумма
	|ИЗ
	|	ВТ_Сотрудники КАК ВТ_Сотрудники
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВКМ_УсловияОплатыСотрудников.СрезПоследних(
	|				&ДатаДокумента,
	|				Сотрудник В
	|					(ВЫБРАТЬ
	|						ВТ_Сотрудники.Сотрудник КАК Сотрудник
	|					ИЗ
	|						ВТ_Сотрудники КАК ВТ_Сотрудники)) КАК BKM_УсловияОплатыСотрудниковСрезПоследних
	|		ПО ВТ_Сотрудники.Сотрудник = BKM_УсловияОплатыСотрудниковСрезПоследних.Сотрудник
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВКМ_ВыполненныеСотрудникомРаботы.ОстаткиИОбороты(
	|				&НачалоПериода,
	|				&КонецПериода,
	|				,
	|				,
	|				Сотрудник В
	|					(ВЫБРАТЬ
	|						ВТ_Сотрудники.Сотрудник КАК Сотрудник
	|					ИЗ
	|						ВТ_Сотрудники КАК ВТ_Сотрудники)) КАК BKM_ВыполненныеСотрудникомРаботыОстаткиИОбороты
	|		ПО ВТ_Сотрудники.Сотрудник = BKM_ВыполненныеСотрудникомРаботыОстаткиИОбороты.Сотрудник
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Корректировка КАК ВТ_Корректировка
	|		ПО ВТ_Сотрудники.Сотрудник = ВТ_Корректировка.Сотрудник";	
	
		
	Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(Объект.Дата));
	Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(Объект.Дата)); 
	Запрос.УстановитьПараметр("ДатаДокумента", Объект.Дата);
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);

	
	Выборка = Запрос.Выполнить().Выбрать();

	Пока Выборка.Следующий() Цикл 
		
		ЗаполнитьЗначенияСвойств(Объект.ОсновныеНачислния.Добавить(), Выборка);
		
		Если Выборка.Сумма <> 0 Тогда
			ЗаполнитьЗначенияСвойств(Объект.ДополнительныеНачисления.Добавить(), Выборка);
		КонецЕсли;
		
	КонецЦикла;		
	
КонецПроцедуры


&НаКлиенте
Функция ДатыЗаполненыВерно()
	
	Для Каждого СтрокаТЧ Из Объект.ОсновныеНачисления Цикл
		
		Результат = Истина;
		Если   СтрокаТЧ.ДатаНачала > СтрокаТЧ.ДатаОкончания Тогда 
			
			Результат = Ложь;
			ТекстСообщения = "Неправильно заполнены поля ДатаНачала и ДатаОкончани. ДатаНачала больше чем ДатаОкончания";
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,"Объект.ОсновныеНачисления[" + Формат(СтрокаТЧ.НомерСтроки -1 ,"ЧДЦ=0; ЧГ=0")  + " ].ДатаНачала");;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;

КонецФункции


#КонецОбласти
